kafka/gce/bench-results.bak/direct-limited/2016-07-11.09-16/producers/client-1.log
2016:07:11 07:16:47,1508 records sent, 301.5 records/sec (29.45 MB/sec), 14.9 ms avg latency, 305.0 max latency.
2016:07:11 07:16:52,1530 records sent, 305.8 records/sec (29.86 MB/sec), 3.4 ms avg latency, 92.0 max latency.
2016:07:11 07:16:57,1509 records sent, 301.7 records/sec (29.46 MB/sec), 2.1 ms avg latency, 42.0 max latency.
2016:07:11 07:17:02,1493 records sent, 298.6 records/sec (29.16 MB/sec), 5.3 ms avg latency, 133.0 max latency.
2016:07:11 07:17:07,1532 records sent, 306.2 records/sec (29.90 MB/sec), 2.1 ms avg latency, 41.0 max latency.
2016:07:11 07:17:12,1529 records sent, 304.8 records/sec (29.76 MB/sec), 1.9 ms avg latency, 38.0 max latency.
2016:07:11 07:17:17,1548 records sent, 309.5 records/sec (30.22 MB/sec), 2.1 ms avg latency, 41.0 max latency.
2016:07:11 07:17:22,1540 records sent, 307.8 records/sec (30.06 MB/sec), 2.4 ms avg latency, 55.0 max latency.
2016:07:11 07:17:27,1542 records sent, 308.4 records/sec (30.12 MB/sec), 8.0 ms avg latency, 192.0 max latency.
2016:07:11 07:17:32,1536 records sent, 307.2 records/sec (30.00 MB/sec), 1.9 ms avg latency, 39.0 max latency.
2016:07:11 07:17:37,1527 records sent, 305.3 records/sec (29.82 MB/sec), 2.4 ms avg latency, 44.0 max latency.
2016:07:11 07:17:42,1534 records sent, 306.7 records/sec (29.95 MB/sec), 2.7 ms avg latency, 66.0 max latency.
2016:07:11 07:17:47,1543 records sent, 308.5 records/sec (30.12 MB/sec), 2.1 ms avg latency, 44.0 max latency.
2016:07:11 07:17:52,1545 records sent, 308.9 records/sec (30.17 MB/sec), 2.0 ms avg latency, 44.0 max latency.
2016:07:11 07:17:57,1543 records sent, 308.5 records/sec (30.12 MB/sec), 2.9 ms avg latency, 64.0 max latency.
2016:07:11 07:18:02,1543 records sent, 308.5 records/sec (30.13 MB/sec), 2.4 ms avg latency, 57.0 max latency.
2016:07:11 07:18:07,1532 records sent, 306.4 records/sec (29.92 MB/sec), 1.9 ms avg latency, 40.0 max latency.
2016:07:11 07:18:12,1530 records sent, 305.9 records/sec (29.87 MB/sec), 8.3 ms avg latency, 210.0 max latency.
2016:07:11 07:18:17,1535 records sent, 306.9 records/sec (29.97 MB/sec), 21.1 ms avg latency, 341.0 max latency.
2016:07:11 07:18:22,1532 records sent, 305.2 records/sec (29.80 MB/sec), 1.9 ms avg latency, 38.0 max latency.
2016:07:11 07:18:27,1546 records sent, 309.2 records/sec (30.20 MB/sec), 2.2 ms avg latency, 48.0 max latency.
2016:07:11 07:18:32,1538 records sent, 307.5 records/sec (30.03 MB/sec), 12.5 ms avg latency, 280.0 max latency.
2016:07:11 07:18:37,1540 records sent, 307.9 records/sec (30.07 MB/sec), 2.3 ms avg latency, 48.0 max latency.
2016:07:11 07:18:42,1529 records sent, 305.7 records/sec (29.86 MB/sec), 2.3 ms avg latency, 45.0 max latency.
2016:07:11 07:18:47,1533 records sent, 306.4 records/sec (29.92 MB/sec), 2.4 ms avg latency, 42.0 max latency.
2016:07:11 07:18:52,1525 records sent, 304.9 records/sec (29.77 MB/sec), 2.1 ms avg latency, 38.0 max latency.
2016:07:11 07:18:57,1535 records sent, 307.0 records/sec (29.98 MB/sec), 1.9 ms avg latency, 39.0 max latency.
2016:07:11 07:19:02,1529 records sent, 305.7 records/sec (29.86 MB/sec), 2.4 ms avg latency, 45.0 max latency.
2016:07:11 07:19:07,1512 records sent, 302.3 records/sec (29.52 MB/sec), 26.5 ms avg latency, 400.0 max latency.
2016:07:11 07:19:12,1529 records sent, 305.8 records/sec (29.86 MB/sec), 2.1 ms avg latency, 46.0 max latency.
2016:07:11 07:19:17,1545 records sent, 308.8 records/sec (30.16 MB/sec), 2.0 ms avg latency, 49.0 max latency.
2016:07:11 07:19:22,1521 records sent, 304.1 records/sec (29.70 MB/sec), 89.0 ms avg latency, 761.0 max latency.
2016:07:11 07:19:27,1547 records sent, 309.3 records/sec (30.20 MB/sec), 2.2 ms avg latency, 45.0 max latency.
2016:07:11 07:19:32,1535 records sent, 306.9 records/sec (29.97 MB/sec), 1.9 ms avg latency, 40.0 max latency.
2016:07:11 07:19:37,1532 records sent, 306.4 records/sec (29.92 MB/sec), 3.0 ms avg latency, 75.0 max latency.
2016:07:11 07:19:42,1542 records sent, 308.4 records/sec (30.12 MB/sec), 6.9 ms avg latency, 146.0 max latency.
2016:07:11 07:19:47,1540 records sent, 307.9 records/sec (30.07 MB/sec), 6.4 ms avg latency, 114.0 max latency.
2016:07:11 07:19:52,1539 records sent, 307.7 records/sec (30.05 MB/sec), 11.0 ms avg latency, 126.0 max latency.
2016:07:11 07:19:57,1530 records sent, 305.8 records/sec (29.86 MB/sec), 22.5 ms avg latency, 240.0 max latency.
2016:07:11 07:20:02,1513 records sent, 302.5 records/sec (29.54 MB/sec), 120.4 ms avg latency, 570.0 max latency.
2016:07:11 07:20:07,1530 records sent, 305.9 records/sec (29.88 MB/sec), 45.3 ms avg latency, 381.0 max latency.
2016:07:11 07:20:12,1540 records sent, 307.9 records/sec (30.07 MB/sec), 15.5 ms avg latency, 133.0 max latency.
2016:07:11 07:20:17,1522 records sent, 304.3 records/sec (29.72 MB/sec), 8.9 ms avg latency, 96.0 max latency.
2016:07:11 07:20:22,1541 records sent, 308.2 records/sec (30.10 MB/sec), 5.3 ms avg latency, 100.0 max latency.
2016:07:11 07:20:27,1514 records sent, 300.7 records/sec (29.36 MB/sec), 53.6 ms avg latency, 390.0 max latency.
2016:07:11 07:20:32,1531 records sent, 306.2 records/sec (29.90 MB/sec), 46.1 ms avg latency, 326.0 max latency.
2016:07:11 07:20:37,1544 records sent, 308.8 records/sec (30.16 MB/sec), 20.1 ms avg latency, 158.0 max latency.
2016:07:11 07:20:42,1522 records sent, 304.2 records/sec (29.71 MB/sec), 10.6 ms avg latency, 174.0 max latency.
2016:07:11 07:20:47,1537 records sent, 307.4 records/sec (30.02 MB/sec), 2.1 ms avg latency, 40.0 max latency.
2016:07:11 07:20:52,1518 records sent, 303.5 records/sec (29.64 MB/sec), 2.6 ms avg latency, 47.0 max latency.
2016:07:11 07:20:58,1543 records sent, 308.5 records/sec (30.12 MB/sec), 1.8 ms avg latency, 39.0 max latency.
2016:07:11 07:21:03,1536 records sent, 307.2 records/sec (30.00 MB/sec), 3.5 ms avg latency, 107.0 max latency.
2016:07:11 07:21:08,1534 records sent, 306.6 records/sec (29.94 MB/sec), 2.0 ms avg latency, 37.0 max latency.
2016:07:11 07:21:13,1534 records sent, 306.7 records/sec (29.95 MB/sec), 1.9 ms avg latency, 38.0 max latency.
2016:07:11 07:21:18,1542 records sent, 308.3 records/sec (30.11 MB/sec), 2.0 ms avg latency, 41.0 max latency.
2016:07:11 07:21:23,1525 records sent, 304.9 records/sec (29.77 MB/sec), 35.6 ms avg latency, 398.0 max latency.
2016:07:11 07:21:28,1539 records sent, 307.7 records/sec (30.05 MB/sec), 2.1 ms avg latency, 41.0 max latency.
2016:07:11 07:21:33,1516 records sent, 303.2 records/sec (29.61 MB/sec), 2.2 ms avg latency, 41.0 max latency.
2016:07:11 07:21:38,1537 records sent, 307.4 records/sec (30.02 MB/sec), 2.3 ms avg latency, 46.0 max latency.
2016:07:11 07:21:43,1528 records sent, 305.5 records/sec (29.83 MB/sec), 3.5 ms avg latency, 79.0 max latency.
2016:07:11 07:21:48,1547 records sent, 309.3 records/sec (30.20 MB/sec), 1.9 ms avg latency, 40.0 max latency.
2016:07:11 07:21:53,1535 records sent, 307.0 records/sec (29.98 MB/sec), 2.6 ms avg latency, 60.0 max latency.
2016:07:11 07:21:58,1533 records sent, 306.6 records/sec (29.94 MB/sec), 17.6 ms avg latency, 333.0 max latency.
2016:07:11 07:22:03,1541 records sent, 308.1 records/sec (30.09 MB/sec), 2.0 ms avg latency, 40.0 max latency.
2016:07:11 07:22:08,1541 records sent, 308.0 records/sec (30.08 MB/sec), 2.1 ms avg latency, 51.0 max latency.
2016:07:11 07:22:13,1544 records sent, 308.7 records/sec (30.15 MB/sec), 2.6 ms avg latency, 50.0 max latency.
2016:07:11 07:22:18,1537 records sent, 307.4 records/sec (30.02 MB/sec), 2.2 ms avg latency, 47.0 max latency.
2016:07:11 07:22:23,1530 records sent, 305.9 records/sec (29.88 MB/sec), 1.9 ms avg latency, 38.0 max latency.
2016:07:11 07:22:28,1516 records sent, 303.2 records/sec (29.61 MB/sec), 14.3 ms avg latency, 298.0 max latency.
2016:07:11 07:22:33,1534 records sent, 306.8 records/sec (29.96 MB/sec), 10.4 ms avg latency, 251.0 max latency.
2016:07:11 07:22:38,1532 records sent, 306.3 records/sec (29.92 MB/sec), 2.3 ms avg latency, 59.0 max latency.
2016:07:11 07:22:43,1542 records sent, 308.3 records/sec (30.11 MB/sec), 2.3 ms avg latency, 45.0 max latency.
2016:07:11 07:22:48,1537 records sent, 307.3 records/sec (30.01 MB/sec), 18.4 ms avg latency, 326.0 max latency.
2016:07:11 07:22:53,1539 records sent, 307.8 records/sec (30.06 MB/sec), 2.0 ms avg latency, 41.0 max latency.
2016:07:11 07:22:58,1538 records sent, 307.6 records/sec (30.04 MB/sec), 2.1 ms avg latency, 46.0 max latency.
2016:07:11 07:23:03,1529 records sent, 305.7 records/sec (29.85 MB/sec), 2.7 ms avg latency, 50.0 max latency.
2016:07:11 07:23:08,1531 records sent, 306.2 records/sec (29.90 MB/sec), 2.3 ms avg latency, 50.0 max latency.
2016:07:11 07:23:13,1537 records sent, 307.4 records/sec (30.02 MB/sec), 1.9 ms avg latency, 44.0 max latency.
2016:07:11 07:23:18,1530 records sent, 306.0 records/sec (29.88 MB/sec), 2.6 ms avg latency, 56.0 max latency.
2016:07:11 07:23:23,1493 records sent, 298.6 records/sec (29.16 MB/sec), 9.9 ms avg latency, 240.0 max latency.
2016:07:11 07:23:28,1429 records sent, 285.8 records/sec (27.91 MB/sec), 2.4 ms avg latency, 44.0 max latency.
2016:07:11 07:23:33,1521 records sent, 304.2 records/sec (29.71 MB/sec), 1.9 ms avg latency, 39.0 max latency.
2016:07:11 07:23:34,126000 records sent, 305.919543 records/sec (29.87 MB/sec), 9.55 ms avg latency, 761.00 ms max latency, 2 ms 50th, 33 ms 95th, 241 ms 99th, 547 ms 99.9th.